<a href="https://colab.research.google.com/github/ajayks1974/learning/blob/master/fds/Handling_missing_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

#Dealing with Missing Data

##Numpy

In [2]:
x = np.array([1,2,3,4,5])

In [3]:
x.sum()

15

In [4]:
print(x.dtype)

int64

In [5]:
x = np.array([1,2,3,'--',5])

In [6]:
print(x.dtype)

<U21

In [7]:
x.sum()

TypeError: ignored

In [8]:
x = np.array([1,2,3,None,5])

In [9]:
x.sum()

TypeError: ignored

In [10]:
x = np.array([1,2,3,np.nan,5])

In [11]:
x.sum()

nan

In [12]:
x_b=[True,True,True,False,True]

In [13]:
x[x_b].sum()

11.0

In [14]:
x[x_b].mean()

2.75

In [15]:
m_x = np.ma.masked_array(x,mask=[0,0,0,1,0])

In [16]:
m_x

masked_array(data=[1.0, 2.0, 3.0, --, 5.0],
             mask=[False, False, False,  True, False],
       fill_value=1e+20)

In [17]:
m_x.sum()

11.0

In [18]:
m_x.mean()

2.75

##Pandas

In [19]:
df = pd.read_csv("room.csv")

In [20]:
df.head()

   Room_Number Num_Students  Department Occupied
0        101.0            1  Mechanical        Y
1        102.0          NaN       Empty        N
2        103.0            3  Electrical        Y
3        104.0            2  Mechanical        Y
4        105.0          NaN    Chemical        N

In [21]:
df.dtypes

Room_Number     float64
Num_Students     object
Department       object
Occupied         object
dtype: object

In [23]:
%timeit np.arange(100000, dtype='int').sum()

The slowest run took 5.22 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 3: 259 µs per loop

In [24]:
%timeit np.arange(100000, dtype='object').sum()

100 loops, best of 3: 6.43 ms per loop

In [25]:
df.Room_Number.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Room_Number, dtype: bool

In [26]:
df.Room_Number.isnull().sum()

1

In [27]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False         False       False      True
9        False         False       False     False

In [29]:
df.isnull().sum()

Room_Number     1
Num_Students    3
Department      0
Occupied        1
dtype: int64

In [30]:
missing_values = ["NA","na", "n/a"]

In [31]:
df = pd.read_csv("room.csv",
                 na_values=missing_values)

In [32]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

In [35]:
df.dtypes

Room_Number     float64
Num_Students    float64
Department       object
Occupied         object
dtype: object

In [36]:
df.Num_Students.sum()

12.0

In [37]:
df.Num_Students.mean()

2.0

In [62]:
missing_values = ["NA","na", "n/a","Empty","--"]

In [63]:
df = pd.read_csv("room.csv",
                 na_values=missing_values)

In [64]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True        True     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False      True
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

In [65]:
df.Department.unique()

array(['Mechanical', nan, 'Electrical', 'Chemical', 'Civil', 'CS'],
      dtype=object)

In [66]:
df.Occupied.fillna('N',inplace=True)

In [67]:
df

   Room_Number  Num_Students  Department Occupied
0        101.0           1.0  Mechanical        Y
1        102.0           NaN         NaN        N
2        103.0           3.0  Electrical        Y
3        104.0           2.0  Mechanical        Y
4        105.0           NaN    Chemical        N
5          NaN           1.0  Electrical        Y
6        107.0           3.0       Civil        N
7        108.0           NaN          CS        Y
8        109.0           NaN  Mechanical        N
9        110.0           2.0          CS        N

In [68]:
def convert_to_binary(v):
    if v == 'Y':
        return True
    else:
        return False

In [69]:
df.Occupied = df.Occupied.apply(convert_to_binary)

In [70]:
df

   Room_Number  Num_Students  Department  Occupied
0        101.0           1.0  Mechanical      True
1        102.0           NaN         NaN     False
2        103.0           3.0  Electrical      True
3        104.0           2.0  Mechanical      True
4        105.0           NaN    Chemical     False
5          NaN           1.0  Electrical      True
6        107.0           3.0       Civil     False
7        108.0           NaN          CS      True
8        109.0           NaN  Mechanical     False
9        110.0           2.0          CS     False

In [71]:
df["Dept2"]= df.Department

In [72]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN         NaN     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [73]:
#df.Department.fillna(method='ffill',inplace=True)
df.Department.fillna(method='pad',inplace=True)

In [74]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [75]:
df.Dept2.fillna(method='bfill',inplace=True)

In [76]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False  Electrical
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [82]:
df.Num_Students.fillna(df.Num_Students.median(),inplace=True)

In [80]:
df.Room_Number.interpolate(inplace=True)

In [81]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False  Electrical
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5        106.0           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS